tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "mongodb/brew"
tap "quackduck/tap"
tap "universal-ctags/universal-ctags"
tap "yt-dlp/taps"
brew "xz", link: false
brew "automake"
brew "lua"
brew "the_silver_searcher"
brew "gettext"
brew "glib"
brew "harfbuzz"
brew "pango"
brew "librsvg"
brew "adwaita-icon-theme"
brew "aria2"
brew "asciinema"
brew "autoconf"
brew "autojump"
brew "pcre"
brew "python@3.9"
brew "libadwaita"
brew "baobab"
brew "bash-completion"
brew "bat"
brew "bpytop"
brew "btop"
brew "c-ares"
brew "cloc"
brew "cmake"
brew "code-server"
brew "curl"
brew "libtool"
brew "freetds"
brew "gd"
brew "php"
brew "composer"
brew "dos2unix"
brew "fd"
brew "ffmpeg"
brew "flamegraph"
brew "node"
brew "fx"
brew "fzf"
brew "gdb"
brew "gh"
brew "git-delta"
brew "go"
brew "golangci-lint"
brew "protobuf"
brew "grpc"
brew "jq"
brew "lazygit"
brew "llvm"
brew "lsof"
brew "lua"
brew "mariadb", restart_service: true
brew "md5sha1sum"
brew "minikube"
brew "mycli"
brew "neovim"
brew "nginx"
brew "openjdk"
brew "pandoc"
brew "pcre"
brew "perl"
brew "pipenv"
brew "pkg-config"
brew "protoc-gen-go-grpc"
brew "python@3.10"
brew "python@3.9"
brew "qt"
brew "ranger"
brew "redis", restart_service: true
brew "rich-cli"
brew "ripgrep"
brew "rlwrap"
brew "smartmontools"
brew "tag"
brew "telnet"
brew "the_silver_searcher"
brew "thefuck"
brew "tig"
brew "tldr"
brew "tmux"
brew "tree"
brew "universal-ctags"
brew "vim"
brew "wget"
brew "wrk"
brew "yarn"
brew "yt-dlp"
brew "z"
brew "zookeeper"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"
brew "mongodb/brew/mongodb-community"
brew "quackduck/tap/cool"
cask "android-file-transfer"
cask "cyberduck"
cask "devtoys"
cask "font-hack-nerd-font"
cask "iina"
cask "iterm2"
cask "karabiner-elements"
cask "keycastr"
cask "kiwix"
cask "macdown"
cask "mark-text"
cask "netnewswire"
cask "notion"
cask "onyx"
cask "orbstack"
cask "postman"
cask "qq"
cask "raycast"
cask "rectangle"
cask "redisinsight"
cask "sequel-ace"
cask "sourcetree"
cask "warp"
vscode "alefragnani.project-manager"
vscode "christian-kohler.path-intellisense"
vscode "cschlosser.doxdocgen"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "golang.go"
vscode "humao.rest-client"
vscode "ibm.output-colorizer"
vscode "jgclark.vscode-todo-highlight"
vscode "mohsen1.prettify-json"
vscode "ms-ceintl.vscode-language-pack-zh-hans"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "naumovs.color-highlight"
vscode "oderwat.indent-rainbow"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "sohamkamani.code-eol"
vscode "twxs.cmake"
vscode "vadimcn.vscode-lldb"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "zxh404.vscode-proto3"
