tap "beeftornado/rmtree"
tap "elastic/tap"
tap "homebrew/bundle"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/command-not-found"
tap "homebrew/services"
tap "muesli/tap"
tap "universal-ctags/universal-ctags"
tap "yt-dlp/taps"
# Core application library for C
brew "glib"
# Perl compatible regular expressions library
brew "pcre"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Vector graphics library with cross-device output support
brew "cairo"
# OpenType text shaping engine
brew "harfbuzz"
# Framework for layout and rendering of i18n text
brew "pango"
# Library to render SVG files using Cairo
brew "librsvg"
# Icons for the GNOME project
brew "adwaita-icon-theme"
# Generic-purpose lossless compression algorithm by Google
brew "brotli"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Record and share terminal sessions
brew "asciinema"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Light UNIX download accelerator
brew "axel"
# Building blocks for modern adaptive GNOME applications
brew "libadwaita"
# Gnome disk usage analyzer
brew "baobab"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Linux/OSX/FreeBSD resource monitor
brew "bpytop"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Asynchronous DNS library
brew "c-ares"
# Like cat but displays content with syntax highlighting
brew "ccat"
# Statistics utility to count lines of code
brew "cloc"
# Cross-platform make
brew "cmake"
# Platform built on V8 to build network applications
brew "node@16"
# Access VS Code through the browser
brew "code-server"
# Tool for service discovery, monitoring and configuration
brew "consul"
# Tool for browsing source code
brew "cscope"
# Open source suite of directory software
brew "openldap"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
# Key value store for shared configuration and service discovery
brew "etcd"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# NaCl networking and cryptography library
brew "libsodium"
# Secure Reliable Transport
brew "srt"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Stack trace visualizer
brew "flamegraph"
# Generic library support script
brew "libtool"
# Libraries to talk to Microsoft SQL Server and Sybase databases
brew "freetds"
# Terminal JSON viewer
brew "fx"
# Command-line fuzzy finder written in Go
brew "fzf"
# Graphics library to dynamically manipulate images
brew "gd"
# GNU debugger
brew "gdb"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Command-driven, interactive function plotting
brew "gnuplot"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Fast linters runner for Go
brew "golangci-lint"
# PAM module for two-factor authentication
brew "google-authenticator-libpam"
# Image manipulation
brew "netpbm"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Asynchronous event library
brew "libev"
# Postgres C API library
brew "libpq"
# Library that provides automatic proxy configuration management
brew "libproxy"
# Utility to list open files
brew "lsof"
# Drop-in replacement for MySQL
brew "mariadb"
# Cryptographic & SSL/TLS library
brew "mbedtls@2"
# Hash utilities
brew "md5sha1sum"
# Scalable distributed version control system
brew "mercurial"
# Run a Kubernetes cluster locally
brew "minikube"
# Cross platform, open source .NET development framework
brew "mono"
# CLI for MySQL with auto-completion and syntax highlighting
brew "mycli"
# HTTP/2 C Library
brew "nghttp2"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx"
# Platform built on V8 to build network applications
brew "node"
# Highly capable, feature-rich programming language
brew "perl"
# General-purpose scripting language
brew "php"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Cross-platform application and UI framework
brew "qt"
# File browser
brew "ranger"
# Persistent key-value database, with built-in net interface
brew "redis"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# SMART hard drive monitoring
brew "smartmontools"
# Code-search similar to ack
brew "the_silver_searcher"
# Text interface for Git repositories
brew "tig"
# Terminal multiplexer
brew "tmux"
# Command-line translator using Google Translate and more
brew "translate-shell"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Vi 'workalike' with many additional features
brew "vim"
# Internet file retriever
brew "wget"
# HTTP benchmarking tool
brew "wrk"
# JavaScript package manager
brew "yarn"
# Disk Usage/Free Utility
brew "muesli/tap/duf"
# Maintained ctags implementation
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
# A youtube-dl fork with additional features and fixes
brew "yt-dlp/taps/yt-dlp"
# Transfer files from and to an Android smartphone
cask "android-file-transfer"
# GUI app for Homebrew
cask "cakebrew"
# Server and cloud storage browser
cask "cyberduck"
# Utilities designed to make common development tasks easier
cask "devtoys"
# Free and open-source media player
cask "iina"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Keyboard customizer
cask "karabiner-elements"
# Open-source keystroke visualizer
cask "keycastr"
# App providing offline access to Wikipedia and many other web sites
cask "kiwix"
# Music app base on Electron & Vue
cask "lx-music"
# Lyrics for iTunes, Spotify, Vox and Audirvana Plus
cask "lyricsx"
# Markdown editor
cask "mark-text"
# Free and open-source RSS reader
cask "netnewswire"
# App to write, plan, collaborate, and get organized
cask "notion"
# Verify system files structure, run miscellaneous maintenance and more
cask "onyx"
# Collaboration platform for API development
cask "postman"
# Instant messaging tool
cask "qq"
# Control your tools with a few keystrokes
cask "raycast"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# MySQL/MariaDB database management platform
cask "sequel-pro"
# Graphical client for Git version control
cask "sourcetree"
# Multimedia player
cask "vlc"
# Rust-based terminal
cask "warp"
