tap "brewforge/extras"
tap "homebrew/bundle"
tap "homebrew/services"
tap "itchyny/tap"
tap "morantron/tmux-fingers"
brew "fontconfig"
brew "autojump"
brew "baobab"
brew "bat"
brew "bed"
brew "btop"
brew "cmake"
brew "dive"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gifsicle"
brew "git-filter-repo"
brew "go"
brew "graphviz"
brew "gum"
brew "helm"
brew "httpie"
brew "jpegoptim"
brew "k9s"
brew "kind"
brew "kubernetes-cli"
brew "kubectx"
brew "lazydocker"
brew "lazygit"
brew "mycli"
brew "mysql-client"
brew "node"
brew "openconnect"
brew "perl"
brew "pngquant"
brew "qemu"
brew "rename"
brew "ripgrep"
brew "rlwrap"
brew "smartmontools"
brew "the_silver_searcher"
brew "thefuck"
brew "tldr"
brew "tmux"
brew "tree"
brew "universal-ctags"
brew "vim"
brew "watch"
brew "yarn"
brew "yt-dlp"
brew "z"
brew "zoxide"
brew "itchyny/tap/mmv"
cask "alfred"
cask "anki"
cask "docker"
cask "flux"
cask "font-hack-nerd-font"
cask "iina"
cask "iterm2"
cask "keka"
cask "lyricsx-mxiris"
cask "macdown"
cask "mitmproxy"
cask "notion"
cask "obsidian"
cask "onyx"
cask "sourcetree"
cask "squirrel"
cask "telegram"
cask "thunder"
cask "xca"
vscode "ecmel.vscode-html-css"
vscode "vscodevim.vim"
